[
  {
    "idx": 0,
    "id": "001a4ea3-491c-4c7d-9cc3-e0f80efc3873",
    "title": "Caz 4: Vânzarea unui laptop",
    "level": "Mediu",
    "week_number": 3,
    "legal_problem": "Validitatea unui contract de vânzare-cumpărare încheiat de un minor cu capacitate de exercițiu restrânsă fără încuviințarea părintelui.",
    "case_description": "Ioana, în vârstă de 17 ani, și-a vândut laptopul pe care îl primise cadou de ziua ei colegului său, Răzvan, pentru suma de 3.500 lei. Ioana avea nevoie urgentă de bani pentru a-și cumpăra un telefon nou. Mama Ioanei, aflând despre vânzare după o săptămână, cere anularea tranzacției și returnarea laptopului. Răzvan refuză, susținând că a cumpărat laptopul în bună-credință și că Ioana nu i-a spus că este minoră.",
    "question": "Este valabilă vânzarea laptopului încheiată între Ioana și Răzvan?",
    "created_at": "2025-10-25 22:44:02.241125+00",
    "updated_at": "2025-10-25 22:44:02.241125+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AAO"
  },
  {
    "idx": 1,
    "id": "002b5fb4-592d-5d8e-0dd4-f1g91fgd4984",
    "title": "Caz 5: Contractul de prestări servicii",
    "level": "Mediu",
    "week_number": 4,
    "legal_problem": "Validitatea contractului de prestări servicii încheiat de un minor cu capacitate de exercițiu restrânsă fără consimțământul ambilor părinți.",
    "case_description": "Andrei, în vârstă de 16 ani, a încheiat un contract cu o firmă de web design pentru realizarea unui site corporate în valoare de 4.200 lei. Tatăl său a semnat o declarație de consimțământ, însă mama nu a fost consultată. După finalizarea lucrării, firma solicită plata integrală. Mama lui Andrei descoperă contractul și refuză plata, invocând că nu și-a dat acordul și că actul este nul pentru lipsa consimțământului ambilor părinți.",
    "question": "Este valabil contractul încheiat de Andrei cu firma de web design?",
    "created_at": "2025-10-26 12:49:34.968171+00",
    "updated_at": "2025-10-26 12:49:34.968196+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1ABO"
  },
  {
    "idx": 2,
    "id": "003c6gc5-693e-6e9f-1ee5-g2h02ghf5095",
    "title": "Caz 6: Donația acceptată de minor",
    "level": "Mediu",
    "week_number": 3,
    "legal_problem": "Acceptarea unei donații de către un minor fără capacitate de exercițiu în absența reprezentării legale.",
    "case_description": "Maria, în vârstă de 10 ani, primește o propunere de donație din partea vecinului său, domnul Popescu, care dorește să îi dăruiască o bicicletă nouă în valoare de 1.500 lei. Maria acceptă singură donația, fără știrea părinților. Părinții Mariei, aflând despre situație, doresc să clarifice dacă acceptarea donației este valabilă și dacă Maria putea să încheie singură acest act juridic.",
    "question": "Este valabilă acceptarea donației de către Maria?",
    "created_at": "2025-10-26 12:49:34.968200+00",
    "updated_at": "2025-10-26 12:49:34.968206+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1ACO"
  },
  {
    "idx": 3,
    "id": "004d7hd6-704f-7f0g-2ff6-h3i13hig6106",
    "title": "Caz 7: Închirierea unui imobil de către tutore",
    "level": "Mediu",
    "week_number": 4,
    "legal_problem": "Validitatea contractului de închiriere încheiat de tutore fără autorizarea instanței de tutelă.",
    "case_description": "Ion este tutorele lui Alexandru, un minor de 13 ani care a moștenit un apartament. Ion încheie un contract de închiriere a apartamentului pe o perioadă de 3 ani, cu o chirie lunară de 1.800 lei, fără a obține autorizarea instanței de tutelă. Consiliul de familie se opune închirierii. După 6 luni, procurorul sesizează instanța solicitând anularea contractului pentru lipsa autorizării.",
    "question": "Este valabil contractul de închiriere încheiat de tutore?",
    "created_at": "2025-10-26 12:49:34.968210+00",
    "updated_at": "2025-10-26 12:49:34.968213+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1ADO"
  },
  {
    "idx": 4,
    "id": "005e8ie7-815g-8g1h-3gg7-i4j24iji7217",
    "title": "Caz 8: Cumpărarea unui telefon de către minor",
    "level": "Mediu",
    "week_number": 3,
    "legal_problem": "Validitatea contractului de vânzare-cumpărare încheiat de un minor cu capacitate de exercițiu restrânsă pentru un bun de valoare medie.",
    "case_description": "Elena, în vârstă de 15 ani, intră într-un magazin și cumpără un telefon mobil în valoare de 2.800 lei, plătind din banii primiți cadou de la bunici. Părinții Elenei descoperă achiziția după două săptămâni și consideră că suma este prea mare pentru vârsta ei. Aceștia solicită anularea contractului și restituirea banilor, invocând lipsa încuviințării lor.",
    "question": "Este valabil contractul de vânzare-cumpărare încheiat de Elena?",
    "created_at": "2025-10-26 12:49:34.968217+00",
    "updated_at": "2025-10-26 12:49:34.968220+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AEO"
  },
  {
    "idx": 5,
    "id": "006f9jf8-926h-9h2i-4hh8-j5k35jkj8328",
    "title": "Caz 9: Vânzarea unui tablou de către minor",
    "level": "Mediu",
    "week_number": 4,
    "legal_problem": "Validitatea vânzării unui bun de valoare încheiate de un minor cu capacitate de exercițiu restrânsă fără încuviințarea părintelui.",
    "case_description": "Cristian, în vârstă de 16 ani, moștenește un tablou de la bunicul său. Având nevoie de bani pentru un curs de programare, Cristian vinde tabloul unui colecționar pentru 5.000 lei, fără a consulta părinții. Mama lui Cristian, pictoriță, descoperă vânzarea și susține că tabloul avea o valoare sentimentală și artistică mult mai mare. Aceasta solicită anularea vânzării.",
    "question": "Este valabilă vânzarea tabloului încheiată de Cristian?",
    "created_at": "2025-10-26 12:49:34.968225+00",
    "updated_at": "2025-10-26 12:49:34.968229+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AFO"
  },
  {
    "idx": 6,
    "id": "007g0kg9-037i-0i3j-5ii9-k6l46klk9439",
    "title": "Caz 10: Contractul de reparații auto",
    "level": "Mediu",
    "week_number": 3,
    "legal_problem": "Validitatea contractului de prestări servicii încheiat de un minor cu capacitate de exercițiu restrânsă pentru repararea unui bun personal.",
    "case_description": "Mihai, în vârstă de 17 ani, proprietarul unei biciclete electrice, încheie un contract de reparații cu un service în valoare de 800 lei. Reparațiile sunt urgente pentru ca Mihai să poată merge la școală. Tatăl lui Mihai refuză să plătească factura, susținând că Mihai nu avea dreptul să încheie singur un astfel de contract fără acordul său prealabil.",
    "question": "Este valabil contractul de reparații încheiat de Mihai?",
    "created_at": "2025-10-26 12:49:34.968232+00",
    "updated_at": "2025-10-26 12:49:34.968235+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AGO"
  },
  {
    "idx": 7,
    "id": "008h1lh0-148j-1j4k-6jj0-l7m57lml0540",
    "title": "Caz 11: Împrumutul acordat de minor",
    "level": "Mediu",
    "week_number": 4,
    "legal_problem": "Validitatea contractului de împrumut încheiat de un minor cu capacitate de exercițiu restrânsă fără încuviințarea ocrotitorului.",
    "case_description": "Diana, în vârstă de 16 ani, împrumută unei prietene suma de 1.200 lei din economiile sale, stabilind restituirea într-o lună. Prietena nu returnează suma la termen. Părinții Dianei descoperă împrumutul și susțin că acesta este nul pentru lipsa încuviințării lor. Diana dorește să recupereze banii.",
    "question": "Este valabil contractul de împrumut încheiat de Diana?",
    "created_at": "2025-10-26 12:49:34.968239+00",
    "updated_at": "2025-10-26 12:49:34.968242+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AHO"
  },
  {
    "idx": 8,
    "id": "009i2mi1-259k-2k5l-7kk1-m8n68mmm1651",
    "title": "Caz 12: Schimbul de bunuri între minori",
    "level": "Mediu",
    "week_number": 3,
    "legal_problem": "Validitatea contractului de schimb încheiat între doi minori cu capacitate de exercițiu restrânsă fără încuviințarea părinților.",
    "case_description": "Vlad, în vârstă de 15 ani, schimbă consola sa de jocuri în valoare de 2.000 lei cu un laptop al colegului său, George, de 16 ani, evaluat la 2.200 lei. Ambii consideră schimbul echitabil. Părinții lui Vlad descoperă schimbul după o lună și solicită anularea acestuia, susținând că fiul lor a fost dezavantajat.",
    "question": "Este valabil contractul de schimb încheiat între Vlad și George?",
    "created_at": "2025-10-26 12:49:34.968246+00",
    "updated_at": "2025-10-26 12:49:34.968248+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AIO"
  },
  {
    "idx": 9,
    "id": "010j3nj2-360l-3l6m-8ll2-n9o79nnn2762",
    "title": "Caz 13: Vânzarea de produse handmade",
    "level": "Mediu",
    "week_number": 4,
    "legal_problem": "Validitatea contractelor de vânzare încheiate de un minor cu capacitate de exercițiu restrânsă în cadrul unei activități comerciale proprii.",
    "case_description": "Anca, în vârstă de 17 ani, creează bijuterii handmade pe care le vinde pe internet. Într-o lună, realizează vânzări în valoare totală de 3.500 lei. Mama Ancăi descoperă activitatea și se îngrijorează că fiica sa încheie contracte fără supravegherea ei. Anca susține că are dreptul să încheie aceste contracte în legătură cu îndeletnicirile sale artistice.",
    "question": "Sunt valabile contractele de vânzare încheiate de Anca?",
    "created_at": "2025-10-26 12:49:34.968252+00",
    "updated_at": "2025-10-26 12:49:34.968255+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AJO"
  },
  {
    "idx": 10,
    "id": "011k4ok3-471m-4m7n-9mm3-o0p80ooo3873",
    "title": "Caz 14: Contractul de comodat",
    "level": "Mediu",
    "week_number": 3,
    "legal_problem": "Validitatea contractului de comodat încheiat de un minor cu capacitate de exercițiu restrânsă fără încuviințarea părintelui.",
    "case_description": "Robert, în vârstă de 16 ani, împrumută unui prieten camera sa foto în valoare de 3.000 lei pentru o perioadă de două luni, fără să ceară nimic în schimb. Tatăl lui Robert descoperă situația și solicită restituirea imediată a camerei, invocând că Robert nu putea încheia singur un astfel de contract cu titlu gratuit.",
    "question": "Este valabil contractul de comodat încheiat de Robert?",
    "created_at": "2025-10-26 12:49:34.968258+00",
    "updated_at": "2025-10-26 12:49:34.968261+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AKO"
  },
  {
    "idx": 11,
    "id": "012l5pl4-582n-5n8o-0nn4-p1q91ppp4984",
    "title": "Caz 15: Achiziția de cursuri online",
    "level": "Mediu",
    "week_number": 4,
    "legal_problem": "Validitatea contractului de prestări servicii educaționale încheiat de un minor cu capacitate de exercițiu restrânsă cu acordul parțial al părinților.",
    "case_description": "Sofia, în vârstă de 17 ani, se înscrie la un curs online de design grafic în valoare de 2.500 lei. Mama ei semnează o declarație de consimțământ, dar tatăl nu este de acord. Sofia plătește prima rată de 1.000 lei din banii primiți de la mama sa. Tatăl descoperă situația și refuză plata restului sumei.",
    "question": "Este valabil contractul încheiat de Sofia?",
    "created_at": "2025-10-26 12:49:34.968265+00",
    "updated_at": "2025-10-26 12:49:34.968267+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1ALO"
  },
  {
    "idx": 12,
    "id": "013m6qm5-693o-6o9p-1oo5-q2r02qqq5095",
    "title": "Caz 16: Vânzarea unui instrument muzical",
    "level": "Mediu",
    "week_number": 3,
    "legal_problem": "Validitatea vânzării unui bun de valoare medie de către un minor cu capacitate de exercițiu restrânsă fără încuviințarea părinților.",
    "case_description": "Alexandra, în vârstă de 15 ani, vinde chitara sa electrică în valoare de 2.200 lei unui coleg de liceu pentru a-și cumpăra o tabletă. Părinții Alexandrei descoperă vânzarea după două săptămâni și solicită anularea contractului, susținând că fiica lor a acționat fără acordul lor și că instrumentul avea o valoare sentimentală.",
    "question": "Este valabilă vânzarea chitarei încheiate de Alexandra?",
    "created_at": "2025-10-26 12:49:34.968271+00",
    "updated_at": "2025-10-26 12:49:34.968274+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AMO"
  },
  {
    "idx": 13,
    "id": "014n7rn6-704p-7p0q-2pp6-r3s13rrr6106",
    "title": "Caz 17: Acceptarea moștenirii de către minor",
    "level": "Mediu",
    "week_number": 4,
    "legal_problem": "Validitatea acceptării moștenirii de către un minor cu capacitate de exercițiu restrânsă fără reprezentarea legală.",
    "case_description": "David, în vârstă de 16 ani, acceptă singur moștenirea lăsată de unchiul său, care include un apartament și datorii în valoare de 15.000 lei. Părinții lui David nu au fost consultați și descoperă acceptarea după închiderea termenului de renunțare. Aceștia solicită anularea acceptării.",
    "question": "Este valabilă acceptarea moștenirii de către David?",
    "created_at": "2025-10-26 12:49:34.968277+00",
    "updated_at": "2025-10-26 12:49:34.968280+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1ANO"
  },
  {
    "idx": 14,
    "id": "015o8so7-815q-8q1r-3qq7-s4t24sss7217",
    "title": "Caz 18: Contractul de antrepriză",
    "level": "Mediu",
    "week_number": 3,
    "legal_problem": "Validitatea contractului de antrepriză încheiat de un minor cu capacitate de exercițiu restrânsă în legătură cu activitățile sale artistice.",
    "case_description": "Laura, în vârstă de 17 ani, dansatoare talentată, încheie un contract cu o școală de dans pentru a preda ore de dans contemporan copiilor, primind 1.500 lei lunar. Mama Laurei consideră că fata sa a încheiat singură un contract important fără consultarea ei.",
    "question": "Este valabil contractul de antrepriză încheiat de Laura?",
    "created_at": "2025-10-26 12:49:34.968283+00",
    "updated_at": "2025-10-26 12:49:34.968286+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1AOO"
  },
  {
    "idx": 15,
    "id": "016p9tp8-926r-9r2s-4rr8-t5u35ttt8328",
    "title": "Caz 19: Cumpărarea de echipament sportiv",
    "level": "Mediu",
    "week_number": 4,
    "legal_problem": "Validitatea contractului de vânzare-cumpărare încheiat de un minor cu capacitate de exercițiu restrânsă pentru un bun necesar activităților sale.",
    "case_description": "Matei, în vârstă de 16 ani, fotbalist la o echipă locală, cumpără echipament sportiv profesional în valoare de 1.800 lei, necesar pentru antrenamente. Tatăl lui Matei consideră suma exagerată și solicită anularea contractului.",
    "question": "Este valabil contractul de vânzare-cumpărare încheiat de Matei?",
    "created_at": "2025-10-26 12:49:34.968292+00",
    "updated_at": "2025-10-26 12:49:34.968295+00",
    "subcategory": "Persoana fizică (Capacitatea de exercițiu)",
    "verified": false,
    "case_code": "CIV1APO"
  }
]